# Przygotowania

- Zaimportuj niezbędne biblioteki zgodnie z konwencją

```
import numpy as np
import pandas as pd
import os 

pd.__version__
```

- Sprawdz strukture plikow, wyswietl zawartosc bieżącego katalogu <br>
  ```os.getcwd()```, ```os.listdir()```
- Stworz katalog ```'outputs'``` <br>
  ```os.mkdir('outputs')```

In [1]:
import numpy as np
import pandas as pd  # konwencja
import os 

pd.__version__

'1.4.2'

In [2]:
!pwd

/Users/kamil/Desktop/SDA/Przetwarzenie_zbiorow_danych

In [4]:
!ls

04_Zbiory_danych_przetwarzanie.pdf pandas_profiling.ipynb
2_1_Titanic.ipynb                  pandas_sda.py
Algebra_Prawd_Stat.pdf             pandas_zadania.ipynb
ML-datasets-master                 report_pandas_profiling.html
ML-datasets-master.zip             sqlalchemy.py
foo.csv                            test_1_zapis.csv
panadas_prezentacja_kod.ipynb      test_df.csv
pandas_odpowiedzi_do_zadan.ipynb   test_pandas_creation.csv

In [3]:
print(os.getcwd())
print(os.listdir())

/Users/kamil/Desktop/SDA/Przetwarzenie_zbiorow_danych
['foo.csv', 'pandas_zadania.ipynb', 'test_pandas_creation.csv', '.DS_Store', 'pandas_sda.py', 'report_pandas_profiling.html', 'test_df.csv', 'pandas_odpowiedzi_do_zadan.ipynb', '04_Zbiory_danych_przetwarzanie.pdf', 'panadas_prezentacja_kod.ipynb', '2_1_Titanic.ipynb', 'Algebra_Prawd_Stat.pdf', 'pandas_profiling.ipynb', 'test_1_zapis.csv', 'sqlalchemy.py', '.ipynb_checkpoints', '.git', 'ML-datasets-master.zip', 'ML-datasets-master']

# Rozgrzewka
1. Stwórz ```pd.dataFrame``` o wymiarach ```(5,3)``` za pomoca:
- podania wartosci <br>```[[],[]]```
- slownika <br>``` {k1:v1,k2:v2}```
- np.array <br>```np.array((a,b,c))```
- tablicy liczb losowych <br>```np.random.randn(nr,nc)```
- ```pd.Series``` i ```np.reshape(a, (nr, nc)) ```
 
<br>Dodaj dowolny index i nazwy kolumn.  
 

Zapisz i odczytaj  tabele jako plik ```test_df.csv``` w katalogu ```outputs``` za pomocą:
```
df.to_csv()
read_csv()
```
Wypróbuj różne separatory, również te niezgodne z zapisem. Zobacz jak wygląda tabela po wczytaniu. <br> 
```
head()
tail() 
sample()
```

In [46]:
a_ls = [['Jacek', 10, 'R&D'],
        ['Barbara', 35, 'Marketing'],
        ['Kacper', 22, 'HR'],
        ['Jagoda', 3, 'IT'],
        ['Bogdan', 41, 'Retail']
       ]

df = pd.DataFrame(a_ls,
                  columns=['Name','ID','Department'],
                  index=[10, 20, 30, 40, 50])

df
#df.to_csv('/Users/kamil/Desktop/SDA/Przetwarzenie_zbiorow_danych/test_df.csv', sep = 'K')

       Name  ID Department
10    Jacek  10        R&D
20  Barbara  35  Marketing
30   Kacper  22         HR
40   Jagoda   3         IT
50   Bogdan  41     Retail

In [39]:
df = pd.read_csv('test_df.csv')
df

       KNameKIDKDepartment
0          10KJacekK10KR&D
1  20KBarbaraK35KMarketing
2        30K"Kacper"K22KHR
3           40KJagodaK3KIT
4      50KBogdanK41KRetail

In [44]:
{
    "Name": ["Jacek", "Barbara", "Kacper", "Jagoda", "Bogdan"],
    "ID": [10, 35, 22, 3, 41],
    "Department": ["R&D", "Marketing", "HR", "IT", "Retails"],
}

{'Name': ['Jacek', 'Barbara', 'Kacper', 'Jagoda', 'Bogdan'],
 'ID': [10, 35, 22, 3, 41],
 'Department': ['R&D', 'Marketing', 'HR', 'IT', 'Retails']}

In [32]:
data_dict = {'Name': ['Jacek', 'Barbara', 'Kacper', 'Jagoda', 'Bogdan'],
             'ID': [10, 35, 22, 3, 41],
             'Department':['R&D', 'Marketing', 'HR', 'IT', 'Retails']
            }

df = pd.DataFrame(data_dict)
df

      Name  ID Department
0    Jacek  10        R&D
1  Barbara  35  Marketing
2   Kacper  22         HR
3   Jagoda   3         IT
4   Bogdan  41    Retails

In [41]:
df.sample(2)

       KNameKIDKDepartment
1  20KBarbaraK35KMarketing
0          10KJacekK10KR&D

In [59]:
df = pd.DataFrame(np.array([['Jacek', 10, 'R&D'],
                            ['Barbara', 35, 'Marketing'],
                            ['Kacper', 22, 'HR'],
                            ['Jagoda', 3, 'IT'],
                            ['Bogdan', 41, 'Retail']
                           ]
                          ),
                  columns=['Name','ID','Department'],
                  index=[10, 20, 30, 40, 50])
df

       Name  ID Department
10    Jacek  10        R&D
20  Barbara  35  Marketing
30   Kacper  22         HR
40   Jagoda   3         IT
50   Bogdan  41     Retail

In [64]:
df.loc[10, "Name"]

'Jacek'

In [72]:
df.iloc[0]['Name']

'Jacek'

In [47]:
pd.DataFrame(np.random.rand(5,3))

          0         1         2
0  0.941188  0.066735  0.200463
1  0.348050  0.385442  0.541657
2  0.394488  0.345286  0.706361
3  0.815606  0.295562  0.836939
4  0.020620  0.422391  0.665696

In [58]:
a = pd.Series(range(1,16))
df = pd.DataFrame(a.values.reshape(5,3))
df

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15

# Zadanie 1

Stwórz dataframe df z dzięsięcioma imionami uczniów i uczennic oraz liczbą 
punktów, jakie uzyskali z egzaminu. Następnie sprawdź, jaka była średnia i 
mediana wyników.

Możesz użyć pliku z imionami z katalogu ML-datasets
Maksymalna ilosc punktow przyjmijmy 100:
```
MaxPoints = 100
```

In [191]:
import pandas as pd

names = pd.read_csv('ML-datasets-master/US_Baby_Names_right.csv')
names

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

In [192]:
names_list = names['Name'].sample(10).values

In [193]:
names_list

array(['Natalee', 'Giavanna', 'Mia', 'Alec', 'Ivanna', 'Beck', 'Kaci',
       'Jael', 'Chase', 'Barry'], dtype=object)

In [194]:
points = np.random.randint(0 , 100, 10)

In [195]:
points

array([52,  1, 23, 57, 26, 92, 40, 90, 12, 97])

In [196]:
df = pd.DataFrame([names_list, points])

In [197]:
df

         0         1    2     3       4     5     6     7      8      9
0  Natalee  Giavanna  Mia  Alec  Ivanna  Beck  Kaci  Jael  Chase  Barry
1       52         1   23    57      26    92    40    90     12     97

In [198]:
df = df.T

In [199]:
import pandas as pd
import numpy as np

MaxPoints = 100
names = pd.read_csv('ML-datasets-master/US_Baby_Names_right.csv')
names_list = names['Name'].sample(10).values

In [200]:
np.random.seed(seed=11)

points = np.random.randint(0,MaxPoints,10)
points

array([25, 63, 80, 91, 81, 55, 13, 76, 33, 71])

In [201]:
df = pd.DataFrame([names_list, points])
df

       0       1       2     3       4      5     6     7          8      9
0  April  Caidyn  Sylvia  Jean  Raegan  Ayden  Rory  Enzo  Zachariah  Aisha
1     25      63      80    91      81     55    13    76         33     71

In [202]:
df = df.T
df

           0   1
0      April  25
1     Caidyn  63
2     Sylvia  80
3       Jean  91
4     Raegan  81
5      Ayden  55
6       Rory  13
7       Enzo  76
8  Zachariah  33
9      Aisha  71

In [203]:
df.columns = ['Name', 'Score']

In [204]:
df['Score'].mean()

58.8

In [205]:
df['Score'].median()

67.0

# Zadanie 2
Bazując na ramce danych utworzonej w poprzednim zadaniu, wyświetl 
czwarty wiersz. Następnie zapisz do osobnej ramki tych uczniów, którzy 
uzyskali wynik powyżej średniej.

In [24]:
df

        Name Score
0     Leland    56
1   Fredrick    52
2    Britney     0
3  Valentina    28
4       Erik    34
5      Greta    37
6  Zephaniah    96
7      Davis    20
8    Solomon    29
9    Kyleigh    14

In [27]:
df.iloc[4:]

        Name Score
4       Erik    34
5      Greta    37
6  Zephaniah    96
7      Davis    20
8    Solomon    29
9    Kyleigh    14

In [81]:
print(f"{df.iloc[4:]}")

        Name Score
4  Priscilla    81
5    Valeria    55
6     Sergio    13
7       Cris    76
8   Courtney    33
9   Estuardo    71

In [82]:
df.mean()

/var/folders/ym/_gh6nz0s645_5m7746np3tf80000gn/T/ipykernel_3320/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Score    58.8
dtype: float64

In [28]:
df['Score'].mean()

36.6

In [29]:
df

        Name Score
0     Leland    56
1   Fredrick    52
2    Britney     0
3  Valentina    28
4       Erik    34
5      Greta    37
6  Zephaniah    96
7      Davis    20
8    Solomon    29
9    Kyleigh    14

In [32]:
df[df['Score']>36.6]

        Name Score
0     Leland    56
1   Fredrick    52
5      Greta    37
6  Zephaniah    96

In [34]:
df[df['Score']>df['Score'].mean()]

        Name Score
0     Leland    56
1   Fredrick    52
5      Greta    37
6  Zephaniah    96

In [83]:
pass_df = df[df['Score']<df['Score'].mean()]
pass_df

       Name Score
0   Michele    25
5   Valeria    55
6    Sergio    13
8  Courtney    33

# Zadanie 3
Dodaj do ramki trzecią kolumnę, w której znajdzie się procentowy wynik 
uczniów i uczennic z tego egzaminu (to znaczy, że każda wartość liczbowa musi 
zostać podzielona przez maksimum punktów, jakie można było na tym 
egzaminie uzyskać). 
Następnie, chcemy zanonimizować kolumnę z imionami: chcemy, by została 
tylko pierwsza i ostatnia litera imienia. Np. dla imienia “Marcelina” chcemy 
zachować “M...a”

In [206]:
df['Percent'] = df['Score']/MaxPoints
df['Percent_group'] = df['Score']/df['Score'].max()

In [207]:
df

        Name Score Percent Percent_group
0      April    25    0.25      0.274725
1     Caidyn    63    0.63      0.692308
2     Sylvia    80     0.8      0.879121
3       Jean    91    0.91           1.0
4     Raegan    81    0.81       0.89011
5      Ayden    55    0.55      0.604396
6       Rory    13    0.13      0.142857
7       Enzo    76    0.76      0.835165
8  Zachariah    33    0.33      0.362637
9      Aisha    71    0.71       0.78022

In [214]:
df['Percent'] = df['Percent'].astype('float')

In [218]:
(df['Percent']*100).astype(str)

0                 25.0
1                 63.0
2                 80.0
3                 91.0
4                 81.0
5    55.00000000000001
6                 13.0
7                 76.0
8                 33.0
9                 71.0
Name: Percent, dtype: object

In [77]:
#example:

df['Score'].apply(lambda x: x+5)

0    30
1    68
2    85
3    96
4    86
5    60
6    18
7    81
8    38
9    76
Name: Score, dtype: int64

In [95]:
df['Name'][0][0] + '...' + df['Name'][0][-1]

'K...a'

      Name Score Procent Procent_grupowy
0     Kyla    25    0.25        0.274725
1      Rey    63    0.63        0.692308
2   August    80     0.8        0.879121
3    Trent    91    0.91             1.0
4    Gavin    81    0.81         0.89011
5    Henry    55    0.55        0.604396
6   Jersey    13    0.13        0.142857
7   Turner    76    0.76        0.835165
8  Addelyn    33    0.33        0.362637
9   Sidney    71    0.71         0.78022

In [100]:
df_kopia = df.iloc[:2]

In [101]:
df_kopia

    Name Score Procent Procent_grupowy
0  K...a    25    0.25        0.274725
1  R...y    63    0.63        0.692308

In [106]:
df["code"]=df["Name"].str[0] +"....."+ df["Name"].str[-1]

In [107]:
df

    Name Score Procent Procent_grupowy     code
0  K...a    25    0.25        0.274725  K.....a
1  R...y    63    0.63        0.692308  R.....y
2  A...t    80     0.8        0.879121  A.....t
3  T...t    91    0.91             1.0  T.....t
4  G...n    81    0.81         0.89011  G.....n
5  H...y    55    0.55        0.604396  H.....y
6  J...y    13    0.13        0.142857  J.....y
7  T...r    76    0.76        0.835165  T.....r
8  A...n    33    0.33        0.362637  A.....n
9  S...y    71    0.71         0.78022  S.....y

In [171]:
df['Percent'] = df['Percent']*100

In [172]:
df

        Name Score Percent Percent_group
0      April    25    25.0      0.274725
1     Caidyn    63    63.0      0.692308
2     Sylvia    80    80.0      0.879121
3       Jean    91    91.0           1.0
4     Raegan    81    81.0       0.89011
5      Ayden    55    55.0      0.604396
6       Rory    13    13.0      0.142857
7       Enzo    76    76.0      0.835165
8  Zachariah    33    33.0      0.362637
9      Aisha    71    71.0       0.78022

In [185]:
df = df.round({'Percent':2})

In [189]:
df = df.round(2)

In [190]:
df['Percent'].astype(str) + '%'

0                 25.0%
1                 63.0%
2                 80.0%
3                 91.0%
4                 81.0%
5    55.00000000000001%
6                 13.0%
7                 76.0%
8                 33.0%
9                 71.0%
Name: Percent, dtype: object

In [233]:
df['Percent'].dtype

dtype('float64')

In [237]:
(df["Percent"].apply(lambda x: "{0:.2f}".format(x * 100))).astype(str) + "%"

0    25.00%
1    63.00%
2    80.00%
3    91.00%
4    81.00%
5    55.00%
6    13.00%
7    76.00%
8    33.00%
9    71.00%
Name: Percent, dtype: object

In [222]:
df['Percent'].apply( lambda x : (x) + '%')'{0:.2f}')

SyntaxError: invalid syntax. Perhaps you forgot a comma? (1684147263.py, line 1)

In [96]:
df['Name'] = df['Name'].apply(lambda x: str(x[0])+'...'+str(x[-1]))
df

    Name Score Procent Procent_grupowy
0  K...a    25    0.25        0.274725
1  R...y    63    0.63        0.692308
2  A...t    80     0.8        0.879121
3  T...t    91    0.91             1.0
4  G...n    81    0.81         0.89011
5  H...y    55    0.55        0.604396
6  J...y    13    0.13        0.142857
7  T...r    76    0.76        0.835165
8  A...n    33    0.33        0.362637
9  S...y    71    0.71         0.78022

# Zadanie 4
Posortuj ramkę danych względem liczby punktów otrzymanych z 
egzaminu, od najwyższego do najniższego. W przypadku takiej samej 
liczby punktów, osoby mają zostać wyświetlone w kolejności 
alfabetycznej.

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_values.html

In [241]:
df.sort_values(['Score', ascending=False)

        Name Score  Percent Percent_group
3       Jean    91     0.91           1.0
4     Raegan    81     0.81       0.89011
2     Sylvia    80     0.80      0.879121
7       Enzo    76     0.76      0.835165
9      Aisha    71     0.71       0.78022
1     Caidyn    63     0.63      0.692308
5      Ayden    55     0.55      0.604396
8  Zachariah    33     0.33      0.362637
0      April    25     0.25      0.274725
6       Rory    13     0.13      0.142857

In [242]:
df.sort_values(['Score', 'Name'], ascending=[False, True])

# df = df.sort_values('Name',ascending = True)
# df=df.sort_values('Points',ascending=False).reset_index(drop=True)
# df

        Name Score  Percent Percent_group
3       Jean    91     0.91           1.0
4     Raegan    81     0.81       0.89011
2     Sylvia    80     0.80      0.879121
7       Enzo    76     0.76      0.835165
9      Aisha    71     0.71       0.78022
1     Caidyn    63     0.63      0.692308
5      Ayden    55     0.55      0.604396
8  Zachariah    33     0.33      0.362637
0      April    25     0.25      0.274725
6       Rory    13     0.13      0.142857

# Zadanie 5
Połącz ze sobą dwie poniższe ramki.
```
student_data1 = pd.DataFrame({
 'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
 'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin']
 })
 
student_data2 = pd.DataFrame({
 'student_id': ['S6', 'S7', 'S8', 'S9', 'S10'],
 'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston']
 })
 ```

In [243]:
student_data1 = pd.DataFrame({
 'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
 'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin']
 })

student_data2 = pd.DataFrame({
 'student_id': ['S6', 'S7', 'S8', 'S9', 'S10'],
 'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston']
 })

In [244]:
student_data1

  student_id              name
0         S1  Danniella Fenton
1         S2      Ryder Storey
2         S3      Bryce Jensen
3         S4         Ed Bernal
4         S5       Kwame Morin

In [245]:
student_data2

  student_id              name
0         S6  Scarlette Fisher
1         S7  Carla Williamson
2         S8       Dante Morse
3         S9    Kaiser William
4        S10   Madeeha Preston

In [246]:
student_data_all = pd.concat(
    [student_data1, student_data2], ignore_index=False, keys=["A", "B"]
).reset_index()
student_data_all

  level_0  level_1 student_id              name
0       A        0         S1  Danniella Fenton
1       A        1         S2      Ryder Storey
2       A        2         S3      Bryce Jensen
3       A        3         S4         Ed Bernal
4       A        4         S5       Kwame Morin
5       B        0         S6  Scarlette Fisher
6       B        1         S7  Carla Williamson
7       B        2         S8       Dante Morse
8       B        3         S9    Kaiser William
9       B        4        S10   Madeeha Preston

In [247]:
dataframe_ls = [student_data1, student_data2]

In [249]:
type(dataframe_ls)

list

In [252]:
pd.concat(dataframe_ls)

  student_id              name
0         S1  Danniella Fenton
1         S2      Ryder Storey
2         S3      Bryce Jensen
3         S4         Ed Bernal
4         S5       Kwame Morin
0         S6  Scarlette Fisher
1         S7  Carla Williamson
2         S8       Dante Morse
3         S9    Kaiser William
4        S10   Madeeha Preston

# Zadanie 6
Do ramki utworzonej w poprzednim zadaniu dodaj informacje o 
rezultatach studentów z ramki poniżej.

wybierz losowo 5 wierszy z poniższej tabeli i połącz z tabelą informacji o studnetach. Jak zmienia się wynik przy łączeniu 
- inner 
- outer
```
exam_results = pd.DataFrame({
 'student_id': ['S2', 'S10', 'S3', 'S1', 'S7', 'S9', 'S5', 'S4', 'S8', 'S6'],
 'marks': [200, 210, 190, 222, 199, 201, 200, 198, 219, 201]
 })
```
https://pandas.pydata.org/docs/reference/api/pandas.merge.html#pandas.merge

In [282]:
exam_results = pd.DataFrame({
 'student_id': ['S2', 'S10', 'S3', 'S1', 'S7', 'S9', 'S5', 'S4', 'S8', 'S6'],
 'marks': [200, 210, 190, 222, 199, 201, 200, 198, 219, 201]
 })

In [295]:
np.random.seed(seed=11)
exam_results = exam_results.sample(5)
exam_results

  student_id  marks
8         S8    219
6         S5    200
7         S4    198
0         S2    200
3         S1    222

In [296]:
exam_results.reset_index(inplace=True)

In [297]:
student_data_all

  level_0  level_1 student_id              name
0       A        0         S1  Danniella Fenton
1       A        1         S2      Ryder Storey
2       A        2         S3      Bryce Jensen
3       A        3         S4         Ed Bernal
4       A        4         S5       Kwame Morin
5       B        0         S6  Scarlette Fisher
6       B        1         S7  Carla Williamson
7       B        2         S8       Dante Morse
8       B        3         S9    Kaiser William
9       B        4        S10   Madeeha Preston

In [298]:
pd.merge(student_data_all,
         exam_results,
         how = 'inner',
         on = 'student_id')

  level_0  level_1 student_id              name  index  marks
0       A        0         S1  Danniella Fenton      3    222
1       A        1         S2      Ryder Storey      0    200
2       A        3         S4         Ed Bernal      7    198
3       A        4         S5       Kwame Morin      6    200
4       B        2         S8       Dante Morse      8    219

In [299]:
pd.merge(student_data_all,
         exam_results,
         how = 'outer',
         on = 'student_id')

  level_0  level_1 student_id              name  index  marks
0       A        0         S1  Danniella Fenton    3.0  222.0
1       A        1         S2      Ryder Storey    0.0  200.0
2       A        2         S3      Bryce Jensen    NaN    NaN
3       A        3         S4         Ed Bernal    7.0  198.0
4       A        4         S5       Kwame Morin    6.0  200.0
5       B        0         S6  Scarlette Fisher    NaN    NaN
6       B        1         S7  Carla Williamson    NaN    NaN
7       B        2         S8       Dante Morse    8.0  219.0
8       B        3         S9    Kaiser William    NaN    NaN
9       B        4        S10   Madeeha Preston    NaN    NaN

# Dodatkowe

In [121]:
df=pd.read_csv('ML-datasets-master/titanic.csv')

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Znajdz srednia wieku pasażera na Tytaniku w zależnosci od płci

In [122]:
df.groupby('Sex').agg({'Age':"mean"})

              Age
Sex
female  27.915709
male    30.726645

# - Znajdź ile średnio przeżyło osób w zależności od płci
# - Znajdź ile średnio przeżyło osób w zależności od płci i Klasy biletu
# - Znajdź ile średnio przeżyło osób w zależności od wieku

In [123]:
print('Survived by Sex:') 
df.groupby('Sex')['Survived'].sum()

Survived by Sex:

Sex
female    233
male      109
Name: Survived, dtype: int64

In [125]:
df.groupby(['Sex', 'Pclass'])['Survived'].sum()

Sex     Pclass
female  1         91
        2         70
        3         72
male    1         45
        2         17
        3         47
Name: Survived, dtype: int64

In [126]:
df.groupby('Age')['Survived'].sum()

Age
0.42     1
0.67     1
0.75     2
0.83     2
0.92     1
        ..
70.00    0
70.50    0
71.00    0
74.00    0
80.00    1
Name: Survived, Length: 88, dtype: int64

In [127]:
print(df['Age'].describe())

labels = ['<20', '20 - 27', '28 - 37', '38 -80']
df['bins'] = pd.qcut(df['Age'], 
                     q=[0, .25, 0.5, 0.75, 1],
                     labels = labels)
df['bins'].value_counts()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

20 - 27    183
<20        179
38 -80     177
28 - 37    175
Name: bins, dtype: int64

## Znajdz max min oraz średnią wieku w zależności od płci i klasy wśród osób które przeżyły

In [129]:
df[df['Survived']==1].groupby(['Sex','Pclass'])['Age'].agg([len,max,min,'mean'])

               len   max    min       mean
Sex    Pclass
female 1        91  63.0  14.00  34.939024
       2        70  55.0   2.00  28.080882
       3        72  63.0   0.75  19.329787
male   1        45  80.0   0.92  36.248000
       2        17  62.0   0.67  16.022000
       3        47  45.0   0.42  22.274211

# Znajdź ile *średnio* przeżyło osób w zależności od płci

In [130]:
df.groupby('Sex')['Survived'].agg([sum,len])

        sum  len
Sex
female  233  314
male    109  577